Учебное_задание/src/DataProcessors/ПроверкаКонтрагентов/ПроверкаКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаКонтрагентов</name>
  <tabularSections>
    <name>СписокКонтрагентов</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Учебное_задание/src/InformationRegisters/КонтактныеЛицаКонтрагентов/КонтактныеЛицаКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактныеЛицаКонтрагентов</name>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учебное_задание/src/DataProcessors/ПроверкаКонтрагентов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыполнитьПроверку(Команда)
	ВыполнитьПроверкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуНаСервере()
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
	|		ПО Контрагенты.Ссылка = КонтактныеЛицаКонтрагентов.Контрагент
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И КонтактныеЛицаКонтрагентов.Контрагент ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Объект.СписокКонтрагентов.Загрузить(Выборка);
	
КонецПроцедуры
